tap "achannarasappa/tap"
tap "browsh-org/browsh"
tap "felixkratz/formulae"
tap "filosottile/musl-cross"
tap "gcenx/wine"
tap "gromgit/brewtils"
tap "gschurck/fuzzybrew"
tap "homielab/mountmate", "https://github.com/homielab/mountmate"
tap "jackielii/tap"
tap "jstkdng/programs"
tap "kegworks-app/kegworks"
tap "koekeishiya/formulae"
tap "lihaoyun6/tap"
tap "lslqtz/formulae"
tap "matars/gitfetch"
tap "mateocerquetella/ricebarmac"
tap "mhaeuser/mhaeuser"
tap "narugit/tap"
tap "nohajc/anylinuxfs"
tap "notwadegrimridge/brew"
tap "philocalyst/tap"
tap "rafaelswi/menubarusb"
tap "rgcr/formulae"
tap "samtay/tui"
tap "sikarugir-app/sikarugir"
tap "slp/krun"
tap "socsieng/tap"
tap "theboredteam/boring-notch"
tap "thezoraiz/ascii-image-converter"
tap "valkyrie00/bbrew"
tap "waydabber/betterdisplay"
tap "wickenico/wailbrew"
tap "zackelia/formulae"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Simple system information tool written in Python
brew "archey4"
# Record and share terminal sessions
brew "asciinema"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Planetarium for your terminal
brew "astroterm"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Bastard Tetris
brew "bastet"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Breadth-first version of find
brew "bfs"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console version of 2048
brew "c2048"
# Text-based personal organizer
brew "calcurse"
# Multi-shell multi-command argument completer
brew "carapace"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Console Bonsai is a bonsai tree generator, written in C using ncurses
brew "cbonsai"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Statistics utility to count lines of code
brew "cloc"
# Console Matrix
brew "cmatrix"
# Create and run Linux containers using lightweight virtual machines
brew "container", link: false
# Manage Apple Container with Docker Compose files
brew "container-compose"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Portable file server
brew "copyparty"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# CPU architecture fetching tool
brew "cpufetch"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash-shell"
# Command-line DNS client
brew "doge"
# YAML Parser
brew "libyaml"
# TUI todo manager
brew "dooit"
# Development kit for the Java programming language
brew "openjdk"
# Command-line interface for Cyberduck (a multi-protocol file transfer tool)
brew "duck"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Classic text adventure game
brew "dungeon"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Terminal JSON viewer
brew "fx"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Multi-platform software reverse engineering framework
brew "ghidra", link: false
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Data validation using Python type hints
brew "pydantic"
# Alternative to top/htop
brew "glances"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Ping, but with a graph
brew "gping"
# GNU grep, egrep and fgrep
brew "grep"
# Command-line tool for generating regular expressions
brew "grex"
# Make JSON greppable
brew "gron"
# Tool for glamorous shell scripts
brew "gum"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# HTTP request visualizer with phase-by-phase timing breakdown
brew "httptap"
# Website copier/offline browser
brew "httrack"
# Fast, highly customisable system info script with LGBTQ+ pride flags
brew "hyfetch"
# Command-line benchmarking tool
brew "hyperfine"
# Tool to report network interface bandwidth
brew "ifstat"
# Display an interface's bandwidth usage
brew "iftop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Command-line note taker
brew "jrnl"
# Command-line music player
brew "kew"
# Terminal UI for Apple Containers
brew "lazycontainer"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal-based SSH manager
brew "lazyssh"
# Pager program similar to more
brew "less"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Text-based web browser
brew "lynx"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Keep your Mac's application settings in sync
brew "mackup"
# Apple Silicon Monitor Top written in Go Lang
brew "mactop"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Quickly generate a temporary email address
brew "mailsy"
# Mac App Store command-line interface
brew "mas"
# Control and observe media playback from the command-line
brew "media-control"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Deep clean and optimize your Mac
brew "mole"
# Drive some car across the moon
brew "moon-buggy"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Powerful paging program
brew "most"
# Command-line music player client for mpd
brew "mpc"
# Music Player Daemon
brew "mpd"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# No Nonsense Neovim Client in Rust
brew "neovide"
# POSIX *nix fetch script using Nerdfonts
brew "nerdfetch"
# Utility for managing network connections
brew "netcat"
# Single-player roguelike video game
brew "nethack"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Graphical client for the Soulseek peer-to-peer network
brew "nicotine-plus"
# Space Invaders in the terminal
brew "ninvaders"
# Port scanning utility for large networks
brew "nmap"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Command-line Git information tool
brew "onefetch"
# Colossal Cave Adventure, the 1995 430-point version
brew "open-adventure"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Minecraft package manager and launcher
brew "pacmc"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "pam-reattach"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Display the PID number for a given process name
brew "pidof"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cowsay but with ponies
brew "ponysay"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Monitor data's progress through a pipe
brew "pv"
# Generic syntax highlighter
brew "pygments"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Reddit, refined for the terminal
brew "reddix"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Terminal based Media Player Client with album art support
brew "rmpc"
# Utility that provides fast incremental file transfer
brew "rsync"
# Web search from the terminal
brew "s-search"
# CLI search and replace | Space Age seD
brew "sad"
# Interactive find and replace in the terminal
brew "scooter"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Intuitive find & replace CLI
brew "sd"
# Smart session manager for the terminal
brew "sesh"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# SMART hard drive monitoring
brew "smartmontools"
# SOcket CAT: netcat on steroids
brew "socat"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Minimal, customizable and neofetch-like weather CLI based on rainy
brew "stormy"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Manipulate and query tags on macOS files
brew "tag"
# Utility to modify the macOS Accessibility Database (TCC.db)
brew "tccutil"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Powerful free data recovery utility
brew "testdisk"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Tool for opening git repositories as tmux sessions
brew "tmux-sessionizer"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Yet another typing test, but crab flavoured
brew "toipe"
# Upgrade all the things
brew "topgrade"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Digital clock in ncurses
brew "tty-clock"
# Command-line tool for sharing terminal over the web
brew "ttyd"
# Simple terminal image viewer written in Rust
brew "viu"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Manage the desktop wallpaper
brew "wallpaper"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Command-line streaming torrent client
brew "webtorrent-cli"
# Internet file retriever
brew "wget"
# Successor of GNU Wget, a file and recursive website downloader
brew "wget2"
# Why is this running?
brew "witr"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Turns macOS input fields into real vim buffers
brew "felixkratz/formulae/svim"
# Fuzzy search for Homebrew packages
brew "gschurck/fuzzybrew/fuzzybrew"
# Simple hotkey daemon for macOS, written in Zig
brew "jackielii/tap/skhd-zig"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
# A neofetch alternative for GitHub quick view
brew "matars/gitfetch/gitfetch"
# Check Temperature by using Apple System Management Control (Smc) tool
brew "narugit/tap/smctemp"
# Mount any linux-supported filesystem read/write using nfs and a microVM
brew "nohajc/anylinuxfs/anylinuxfs"
# User-friendly, lightweight TUI for disk imaging
brew "philocalyst/tap/caligula"
# Swiss Army Knife for macOS
brew "rgcr/formulae/m-cli"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Command-line tool for automating keystrokes and mouse events
brew "socsieng/tap/sendkeys"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# Modern TUI for managing Homebrew packages and casks on macOS and Linux
brew "valkyrie00/bbrew/bbrew"
# BetterDisplay CLI proxy
brew "waydabber/betterdisplay/betterdisplaycli"
# Get the battery level of all your devices on your Mac.
cask "lihaoyun6/tap/airbattery"
# Enable Windows-like alt-tab
cask "alt-tab"
# iOS App Store alternative
cask "altserver"
# Helper for Sindre Sorhus's apps
cask "app-buddy"
# Inspect application bundles
cask "apparency"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Control the platform power state of your Apple Silicon device
cask "mhaeuser/mhaeuser/battery-toolkit"
# Online gaming platform
cask "battle-net"
# Installer for BetterDiscord
cask "betterdiscord-installer"
# Display management tool
cask "betterdisplay"
# Utility improving 3rd party mouse performance and functionalities
cask "bettermouse"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool@alpha"
# 3D creation suite
cask "blender"
# Monitors common persistence locations
cask "blockblock"
# File manager
cask "bloom"
# Mobile gaming platform
cask "bluestacks"
# Not so boring notch That Rocks 🎸🎶 
cask "theboredteam/boring-notch/boring-notch"
# CD burning application
cask "burn"
# E-books management software
cask "calibre"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Image, video and clipboard optimiser
cask "clop"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Mount network shares quick and easy
cask "connectmenow"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Plain-text editor for web pages, program source codes and more
cask "coteditor"
# Tool to run Windows software
cask "crossover"
# Download and manage your addons and mods
cask "curseforge"
# Customise menu item keyboard shortcuts
cask "customshortcuts"
# Server and cloud storage browser
cask "cyberduck"
# AI-powered translator
cask "deepl"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Voice and text chat software
cask "discord"
# Show available disk space on APFS volumes
cask "diskspace"
# Monitor DNS activity
cask "dnsmonitor"
# Open-source physical access (aka 'evil maid') attack detector
cask "do-not-disturb"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Downloads videos from different websites
cask "downie"
# Launcher for *Epic Games* games
cask "epic-games"
# Tool for organising and renaming movies, TV shows, anime or music
cask "filebot"
# Monitor filesystem activity
cask "filemonitor"
# File finder
cask "find-any-file"
# Screen colour temperature controller
cask "flux-app"
# Focusrite interface controller
cask "focusrite-control"
cask "font-sketchybar-app-font"
# Audio player
cask "foobar2000"
# Audio converter and CD ripper
cask "freac"
# 3D parametric modeller
cask "freecad"
# Use to eliminate months of up-front work and evaluate how well your game runs
cask "gcenx/wine/game-porting-toolkit"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Game client
cask "gog-galaxy"
# Virtual globe
cask "google-earth-pro"
# Graphically shows disk usage within a file system
cask "grandperspective"
# IRC client
cask "halloy"
# Desktop automation application
cask "hammerspoon"
# Open-source video transcoder
cask "handbrake-app"
# Automated organisation
cask "hazel"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# Tool to optimise images to a smaller size
cask "imageoptim"
# Vector graphics editor
cask "inkscape"
# Download manager
cask "jdownloader"
# Menu bar manager
cask "jordanbaird-ice@beta"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# Automation software
cask "keyboard-maestro"
# Open-source keystroke visualiser
cask "keycastr"
# Find shortcuts for any installed application
cask "keyclu"
# Tool to show what is persistently installed on the computer
cask "knockknock"
# Free and open-source painting and sketching program
cask "krita"
# Application launcher
cask "leader-key"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Host-based application firewall
cask "little-snitch"
# Discover, download, and run local LLMs
cask "lm-studio"
# Software for Logitech devices
cask "logi-options+"
# Trims video and audio files losslessly
cask "losslesscut"
# File system integration
cask "macfuse"
# Speech recognition tool
cask "macwhisper"
# Video format converter (transcoder)
cask "makemkv"
# Display technical and tag data for video and audio files
cask "mediainfo"
# UI replacement for volume, brightness and now playing controls
cask "mediamate"
# Track your USB devices in the macOS menu bar
cask "rafaelswi/menubarusb/menubarusb"
# Access the menu from anywhere
cask "menuwhere"
# Sandbox construction video game
cask "minecraft"
# Manage your windows in Mission Control
cask "mission-control-plus"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix-app"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# Menubar app to easily manage external drives
cask "mountmate"
# Mouse control with the keyboard
cask "mouseless"
# Tool for editing metadata of audio files including MP3, FLAC, OGG, and more
cask "mp3tag"
# Open-source music notation software
cask "musescore"
# Music app blocker utility
cask "music-decoy"
# Network information and diagnostics utility
cask "neo-network-utility"
# Neovim Client
cask "neovide-app"
# Free and open-source RSS reader
cask "netnewswire"
# Calculator and converter application
cask "numi"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# System and utility switches
cask "only-switch"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Retro video game emulation
cask "openemu"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Monitors computer mic and webcam
cask "oversight"
# Share audio between two Bluetooth devices
cask "pairpods"
# Playstation 2 Emulator
cask "pcsx2"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Converts and edits video, audio or image files
cask "permute"
# Control where notifications appear on your screen.
cask "notwadegrimridge/brew/pingplace"
# Home media player
cask "plex"
# Music player focusing on visuals
cask "plexamp"
# Used to access context-specific actions when text is selected
cask "popclip"
# Install games and apps compiled for Microsoft Windows
cask "porting-kit"
# Monitor process activity
cask "processmonitor"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# A lightweight and high-performance screen recorder for macOS.
cask "lihaoyun6/tap/quickrecorder"
# Protect your personal files
cask "ransomwhere"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# WinAMP clone written in SwiftUI
cask "reamp"
# Dreamcast emulator
cask "redream"
# Scans, detects, and monitors keyboard taps
cask "reikey"
# Free and open-source page layout program
cask "scribus"
# Integrated development environment focused entirely on AppleScript
cask "script-debugger"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# App that enables mouse-free UI interaction
cask "shortcat"
# Screenshot measurement and annotation tool
cask "shottr"
# Instant messaging application focusing on security
cask "signal"
# Porting tool, to make Windows programs/games into native apps
cask "kegworks-app/kegworks/sikarugir"
# Automatically checks computer's security
cask "silentknight"
# Team communication and collaboration software
cask "slack"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Application to control your PlayStation 4 or PlayStation 5
cask "sony-ps-remote-play"
# Sound and audio controller
cask "soundsource"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Mux and tag mp4 files
cask "subler"
# Application for inspecting installer packages
cask "suspicious-package"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Quicklook extension for source files
cask "syntax-highlight"
# Tool to explore all the running tasks (processes)
cask "taskexplorer"
# Messaging app with a focus on speed and security
cask "telegram"
# Instant fuzzy finder for files including system and hidden files
cask "thelowtechguys-cling"
# Connectivity software for the TI-84 Plus family of graphing calculators
cask "ti-connect-ce"
# Multi-platform VNC client and server
cask "tigervnc"
# Utility to change the default backup interval of Time Machine
cask "timemachineeditor"
# Alter the character of your TonePrint pedal
cask "toneprint"
# Web browser focusing on security
cask "tor-browser"
# Batch rename utility
cask "transnomino"
# Run commands and display their output on the desktop
cask "ubersicht"
# Newsreader and Usenet client
cask "usenapp"
# Virtual machines UI using QEMU
cask "utm"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# Manage Homebrew packages with a UI
cask "wickenico/wailbrew/wailbrew"
# Torrent streaming application
cask "webtorrent"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Native desktop client for WhatsApp
cask "whatsapp"
# Wine wrapper built with SwiftUI
cask "whisky"
# Original Xbox Emulator
cask "xemu"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "2048 Game", id: 871033113
mas "Actions", id: 1586435171
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Bonjourr Startpage", id: 1615431236
mas "Broadcasts", id: 1469995354
mas "Color Picker", id: 1545870783
mas "Compressor", id: 424390742
mas "Dark Night", id: 1592844577
mas "Dato", id: 1470584107
mas "Developer", id: 640199958
mas "Dropover", id: 1355679052
mas "Final Cut Pro", id: 424389933
mas "Folder Preview", id: 6698876601
mas "Gemini 2", id: 1090488118
mas "Gifski", id: 1351639930
mas "HEIC Converter", id: 1294126402
mas "InfoCard", id: 1110195348
mas "Keynote", id: 361285480
mas "Keyword Search", id: 1558453954
mas "Klack", id: 6446206067
mas "Knights of the Old Republic", id: 416608891
mas "Lickable Menu Bar", id: 6444217677
mas "Logic Pro", id: 634148309
mas "Mactracker", id: 430255202
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "MyWallpaper", id: 1552826194
mas "Night Sky X", id: 475772902
mas "Numbers", id: 361304891
mas "Pages", id: 361309726
mas "Parcel", id: 375589283
mas "Passepartout", id: 1433648537
mas "PDFgear", id: 6469021132
mas "Pixelmator Pro", id: 1289583905
mas "Poolsuite FM", id: 1514817810
mas "Refined GitHub", id: 1519867270
mas "Sandkorn", id: 1377973524
mas "Shareful", id: 1522267256
mas "Simple Comic", id: 1497435571
mas "Sparrow Weather", id: 6449440582
mas "Speediness", id: 1596706466
mas "Star Wars®: Knights of the Old Republic™ II", id: 960778634
mas "Startup Manager", id: 1296723195
mas "Swift Playground", id: 1496833156
mas "TestFlight", id: 899247664
mas "uBlock Origin Lite", id: 6745342698
mas "Unsplash Wallpapers", id: 1284863847
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
mas "Xmind", id: 1327661892
mas "YABA", id: 6747272081
vscode "aaron-bond.better-comments"
vscode "adamraichu.docx-viewer"
vscode "adamraichu.zip-viewer"
vscode "alefragnani.bookmarks"
vscode "arthurlobo.easy-codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "avetis.tokyo-night"
vscode "beem.monochromator"
vscode "bierner.emojisense"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "ericsia.pythonsnippets3pro"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "gydunhn.vsc-essentials"
vscode "gydunhn.vsc-essentials-core"
vscode "ibm.output-colorizer"
vscode "illixion.vscode-vibrancy-continued"
vscode "iocave.monkey-patch"
vscode "j-f1.sf-symbols"
vscode "jdinhlife.gruvbox"
vscode "johnnymorganz.stylua"
vscode "johnpapa.vscode-peacock"
vscode "kevingamer3d2.selene-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "learn-pack.learnpack-vscode"
vscode "louisyoungx.shibuya"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "moshfeu.diff-merge"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "python-beautifier.python-beautifier"
vscode "redhat.vscode-yaml"
vscode "sceleratis.extra-dark-modern"
vscode "sumneko.lua"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "urin.vscode-web-visual-editor"
vscode "usernamehw.errorlens"
vscode "venage5603.tokyo-night-dark-enhanced"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
