tap "achannarasappa/tap"
tap "browsh-org/browsh"
tap "felixkratz/formulae"
tap "filosottile/musl-cross"
tap "gcenx/wine"
tap "homebrew/services"
tap "jackielii/tap"
tap "jstkdng/programs"
tap "kegworks-app/kegworks"
tap "koekeishiya/formulae"
tap "lihaoyun6/tap"
tap "lslqtz/formulae"
tap "mhaeuser/mhaeuser"
tap "narugit/tap"
tap "nohajc/anylinuxfs"
tap "notwadegrimridge/brew"
tap "philocalyst/tap"
tap "samtay/tui"
tap "slp/krun"
tap "socsieng/tap"
tap "thezoraiz/ascii-image-converter"
tap "waydabber/betterdisplay"
tap "zackelia/formulae"
# Portable ASCII art graphics library
brew "aalib"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Library for command-line editing
brew "readline"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Email client that runs in your terminal
brew "aerc"
# Simple system information tool written in Python
brew "archey4"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Planetarium for your terminal
brew "astroterm"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# B2 Cloud Storage Command-Line Tools
brew "b2-tools"
# Terminal bandwidth utilization tool
brew "bandwhich"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Bastard Tetris
brew "bastet"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Parser generator
brew "bison"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Change macOS display brightness from the command-line
brew "brightness"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console version of 2048
brew "c2048"
# Text-based personal organizer
brew "calcurse"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Emacs dependency management
brew "cask"
# Console-based Audio Visualizer for ALSA
brew "cava"
# CloudFlare's PKI toolkit
brew "cfssl"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Ruby environment tool
brew "chruby"
# Tool for emulating mouse and keyboard events
brew "cliclick"
# Console Matrix
brew "cmatrix"
# Music player with an ncurses based interface
brew "cmus"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Manage Apple Container with Docker Compose files
brew "container-compose"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Portable file server
brew "copyparty"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# DDC monitor controls (brightness) for Mac OSX command-line
brew "ddcctl"
# Command-line DNS client
brew "doge"
# YAML Parser
brew "libyaml"
# TUI todo manager
brew "dooit"
# Development kit for the Java programming language
brew "openjdk"
# Command-line interface for Cyberduck (a multi-protocol file transfer tool)
brew "duck"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Classic text adventure game
brew "dungeon"
# More intuitive version of du in rust
brew "dust"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Utilities for the ext2, ext3, and ext4 file systems
brew "e2fsprogs"
# Run arbitrary commands when files change
brew "entr"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Download assets from a commit, branch, or tag of GitHub repositories
brew "fetch"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Command-line fuzzy finder written in Go
brew "fzf"
# Interactive git commands in the terminal
brew "forgit"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Terminal JSON viewer
brew "fx"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ping, but with a graph
brew "gping"
# GNU grep, egrep and fgrep
brew "grep"
# Make JSON greppable
brew "gron"
# Access DVDs as block devices without the decryption
brew "libdvdcss"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake", link: false
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Ping-like tool for HTTP requests
brew "httping"
# Website copier/offline browser
brew "httrack"
# Fast, highly customisable system info script with LGBTQ+ pride flags
brew "hyfetch"
# Tool to report network interface bandwidth
brew "ifstat"
# Display an interface's bandwidth usage
brew "iftop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Command-line music player
brew "kew"
# Terminal UI for Apple Containers
brew "lazycontainer"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal-based SSH manager
brew "lazyssh"
# Pager program similar to more
brew "less"
# Portable Foreign Function Interface library
brew "libffi"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Rainbows and unicorns in your console!
brew "lolcat"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# System information fetcher, with an emphasis on performance and minimalism
brew "macchina"
# Keep your Mac's application settings in sync
brew "mackup"
# Platform built on V8 to build network applications
brew "node"
# Quickly generate a temporary email address
brew "mailsy"
# Mac App Store command-line interface
brew "mas"
# Control and observe media playback from the command-line
brew "media-control"
# Unified display of technical and tag data for audio/video
brew "media-info"
# Matroska media files manipulation tools
brew "mkvtoolnix"
# Terminal-based music player
brew "moc"
# Drive some car across the moon
brew "moon-buggy"
# Remote terminal application
brew "mosh"
# Powerful paging program
brew "most"
# Command-line music player client for mpd
brew "mpc"
# Music Player Daemon
brew "mpd", restart_service: :changed
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Media player based on MPlayer and mplayer2
brew "mpv"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# POSIX *nix fetch script using Nerdfonts
brew "nerdfetch"
# Utility for managing network connections
brew "netcat"
# Single-player roguelike video game
brew "nethack"
# RSS/Atom feed reader for text terminals
brew "newsboat"
# Graphical client for the Soulseek peer-to-peer network
brew "nicotine-plus"
# Space Invaders in the terminal
brew "ninvaders"
# Port scanning utility for large networks
brew "nmap"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Send push notifications to your phone or desktop via PUT/POST
brew "ntfy"
# Renders an animated, color, ANSI-text loop of the Poptart Cat
brew "nyancat"
# Command-line Git information tool
brew "onefetch"
# Colossal Cave Adventure, the 1995 430-point version
brew "open-adventure"
# AI coding agent, built for the terminal
brew "opencode"
# Painless compression and decompression for your terminal
brew "ouch"
# Minecraft package manager and launcher
brew "pacmc"
# Pretty system information tool written in POSIX sh
brew "pfetch"
# Display the PID number for a given process name
brew "pidof"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Cowsay but with ponies
brew "ponysay"
# Theme for zsh
brew "powerlevel10k"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Command-line deletion tool focused on safety, ergonomics, and performance
brew "rm-improved"
# Extremely fast tool to remove dupes and other lint from your filesystem
brew "rmlint"
# Terminal based Media Player Client with album art support
brew "rmpc"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Web search from the terminal
brew "s-search"
# CLI search and replace | Space Age seD
brew "sad"
# Interactive find and replace in the terminal
brew "scooter"
# Generate ASCII art with terminal, shell, and OS info
brew "screenfetch"
# Intuitive find & replace CLI
brew "sd"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# SMART hard drive monitoring
brew "smartmontools"
# Run a command at a particular time
brew "snooze"
# SOcket CAT: netcat on steroids
brew "socat"
# SOund eXchange: universal sound sample translator
brew "sox"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Minimal, customizable and neofetch-like weather CLI based on rainy
brew "stormy"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Nodejs-based tool for optimizing SVG vector graphics files
brew "svgo"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# Manipulate and query tags on macOS files
brew "tag"
# Command-line Kanban board/task manager with support for Trello
brew "taskell"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Powerful free data recovery utility
brew "testdisk"
# Programmatically correct mistyped console commands
brew "thefuck"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Yet another typing test, but crab flavoured
brew "toipe"
# Upgrade all the things
brew "topgrade"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Language for application scale JavaScript development
brew "typescript"
# Simple terminal image viewer written in Rust
brew "viu"
# Language servers for HTML, CSS, JavaScript, and JSON extracted from vscode
brew "vscode-langservers-extracted"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Successor of GNU Wget, a file and recursive website downloader
brew "wget2"
# Show the current WiFi network password
brew "wifi-password"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Terminal stock ticker with live updates and position tracking
brew "achannarasappa/tap/ticker"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Turns macOS input fields into real vim buffers
brew "felixkratz/formulae/svim"
# Simple hotkey daemon for macOS, written in Zig
brew "jackielii/tap/skhd-zig"
# Drop in replacement for ueberzug written in C++
brew "jstkdng/programs/ueberzugpp"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# A background looping utility that maintains the battery level of Apple Silicon based Mac computers
brew "lslqtz/formulae/bclm_loop"
# Check Temperature by using Apple System Management Control (Smc) tool
brew "narugit/tap/smctemp"
# Mount any linux-supported filesystem read/write using nfs and a microVM
brew "nohajc/anylinuxfs/anylinuxfs"
# User-friendly, lightweight TUI for disk imaging
brew "philocalyst/tap/caligula"
# Tetris in your terminal
brew "samtay/tui/tetris"
# Command-line tool for automating keystrokes and mouse events
brew "socsieng/tap/sendkeys"
# Convert images into ascii art
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
# BetterDisplay CLI proxy
brew "waydabber/betterdisplay/betterdisplaycli"
# Get the battery level of all your devices on your Mac.
cask "airbattery"
# Enable Windows-like alt-tab
cask "alt-tab"
# iOS App Store alternative
cask "altserver"
# Inspect application bundles
cask "apparency"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Control the platform power state of your Apple Silicon device
cask "battery-toolkit"
# Display management tool
cask "betterdisplay"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool@alpha"
# CD burning application
cask "burn"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Image, video and clipboard optimiser
cask "clop"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
# Create and run Linux containers using lightweight virtual machines
cask "container"
# Download and manage your addons and mods
cask "curseforge"
# Server and cloud storage browser
cask "cyberduck"
# AI-powered translator
cask "deepl"
# Utility to enhance the Open and Save dialogs in applications
cask "default-folder-x"
# Voice and text chat software
cask "discord"
# Emulator to play GameCube and Wii games
cask "dolphin"
# Downloads videos from different websites
cask "downie"
# Tool for organising and renaming movies, TV shows, anime or music
cask "filebot"
# File finder
cask "find-any-file"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sf-mono"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono-nerd-font"
# Audio converter and CD ripper
cask "freac"
# Desktop client for GitHub repositories
cask "github"
# Virtual globe
cask "google-earth-pro"
# Graphically shows disk usage within a file system
cask "grandperspective"
# IRC client
cask "halloy"
# Open-source video transcoder
cask "handbrake-app"
# Chromium-based web browser
cask "helium-browser"
# Free and open-source media player
cask "iina"
# Vector graphics editor
cask "inkscape"
# Porting tool, to make Windows programs/games into native apps
cask "kegworks"
# File archiver
cask "keka"
# Open-source keystroke visualiser
cask "keycastr"
# Host-based application firewall
cask "little-snitch"
# File system integration
cask "macfuse"
# Video format converter (transcoder)
cask "makemkv"
# Display technical and tag data for video and audio files
cask "mediainfo"
# UI replacement for volume, brightness and now playing controls
cask "mediamate"
# Access the menu from anywhere
cask "menuwhere"
# Sandbox construction video game
cask "minecraft"
# Manage your windows in Mission Control
cask "mission-control-plus"
# Mounts servers and cloud storages as a disk on the desktop
cask "mountain-duck"
# Tool for editing metadata of audio files including MP3, FLAC, OGG, and more
cask "mp3tag"
# Music app blocker utility
cask "music-decoy"
# Free and open-source RSS reader
cask "netnewswire"
# Dual-pane file manager
cask "nimble-commander"
# Open-source software for live streaming and screen recording
cask "obs"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Retro video game emulation
cask "openemu"
# Replacement for Docker Desktop
cask "orbstack"
# Share audio between two Bluetooth devices
cask "pairpods"
# Playstation 2 Emulator
cask "pcsx2"
# Converts and edits video, audio or image files
cask "permute"
# Control where notifications appear on your screen.
cask "pingplace"
# Home media player
cask "plex"
# Used to access context-specific actions when text is selected
cask "popclip"
# Install games and apps compiled for Microsoft Windows
cask "porting-kit"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Dreamcast emulator
cask "redream"
# Free and open-source page layout program
cask "scribus"
# Integrated development environment focused entirely on AppleScript
cask "script-debugger"
# Screenshot measurement and annotation tool
cask "shottr"
# Application to control your PlayStation 4 or PlayStation 5
cask "sony-ps-remote-play"
# Sound and audio controller
cask "soundsource"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# Mux and tag mp4 files
cask "subler"
# Application for inspecting installer packages
cask "suspicious-package"
# Quicklook extension for source files
cask "syntax-highlight"
# Instant fuzzy finder for files including system and hidden files
cask "thelowtechguys-cling"
# Connectivity software for the TI-84 Plus family of graphing calculators
cask "ti-connect-ce"
# Multi-platform VNC client and server
cask "tigervnc-viewer"
# Web browser focusing on security
cask "tor-browser"
# Batch rename utility
cask "transnomino"
# Newsreader and Usenet client
cask "usenapp"
# Virtual machines UI using QEMU
cask "utm"
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "vscodium"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
# Wine wrapper built with SwiftUI
cask "whisky"
# Original Xbox Emulator
cask "xemu"
# Hides privacy indicators
cask "yellowdot"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "Actions", id: 1586435171
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Broadcasts", id: 1469995354
mas "CloudMounter", id: 1130254674
mas "Compressor", id: 424390742
mas "Dato", id: 1470584107
mas "Dropover", id: 1355679052
mas "Final Cut Pro", id: 424389933
mas "Folder Preview", id: 6698876601
mas "Keynote", id: 409183694
mas "Klack", id: 6446206067
mas "Knights of the Old Republic", id: 416608891
mas "Logic Pro", id: 634148309
mas "Mactracker", id: 430255202
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Night Sky X", id: 475772902
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Passepartout", id: 1433648537
mas "Pixelmator Pro", id: 1289583905
mas "Poolsuite FM", id: 1514817810
mas "Shareful", id: 1522267256
mas "Sparrow Weather", id: 6449440582
mas "Star Wars®: Knights of the Old Republic™ II", id: 960778634
mas "Swift Playground", id: 1496833156
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "adamraichu.docx-viewer"
vscode "adamraichu.zip-viewer"
vscode "alefragnani.bookmarks"
vscode "arthurlobo.easy-codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "avetis.tokyo-night"
vscode "beem.monochromator"
vscode "bierner.emojisense"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "ericsia.pythonsnippets3pro"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "gydunhn.vsc-essentials"
vscode "gydunhn.vsc-essentials-core"
vscode "ibm.output-colorizer"
vscode "iocave.monkey-patch"
vscode "j-f1.sf-symbols"
vscode "jdinhlife.gruvbox"
vscode "johnnymorganz.stylua"
vscode "johnpapa.vscode-peacock"
vscode "kevingamer3d2.selene-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "learn-pack.learnpack-vscode"
vscode "louisyoungx.shibuya"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mgesbert.python-path"
vscode "mhutchie.git-graph"
vscode "moshfeu.diff-merge"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "python-beautifier.python-beautifier"
vscode "redhat.vscode-yaml"
vscode "sceleratis.extra-dark-modern"
vscode "sumneko.lua"
vscode "tombonnike.vscode-status-bar-format-toggle"
vscode "urin.vscode-web-visual-editor"
vscode "usernamehw.errorlens"
vscode "venage5603.tokyo-night-dark-enhanced"
vscode "vscode-icons-team.vscode-icons"
vscode "waderyan.gitblame"
vscode "yzhang.markdown-all-in-one"
vscode "zenclabs.previewjs"
